In [11]:
import pandas as pd
pd.set_option('display.max_columns',10)
print("Original data:\n")
df=pd.read_excel("D:\dcap.xlsx")
print(df)

Original data:

   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0   101    DEEPA     50.0     67     50     67.0      50    284
1   102   DINESH     56.0     89     56     89.0      56    346
2   103   KAVIYA     80.0     80     80     80.0      80    400
3   104  RACHEAL     89.0     87     89     87.0      89    441
4   105    RAJAN      NaN     98     90     98.0      90    466
5   106    RAMYA     67.0     76     67     76.0      67    353
6   107    ROHAN     56.0     67     56     67.0      56    302
7   108   ROHINI     57.0     65     57     65.0      57    301
8   109  SANDHYA     58.0     56     58     56.0      58    286
9   110  SARANYA     49.0     45     49      NaN      49    237

In [15]:
f=df['NAME'].str.strip()
f.to_excel("D:\dcap.xlsx")

In [16]:
print("\nReplace value:")
k=df.fillna(method='pad')
print(k)
print("\nUpdated list\n")
k.to_excel("D:\dcap.xlsx")

Replace value:
   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  SOCIAL  TOTAL
0   101    DEEPA     50.0     67     50     67.0      50    284
1   102   DINESH     56.0     89     56     89.0      56    346
2   103   KAVIYA     80.0     80     80     80.0      80    400
3   104  RACHEAL     89.0     87     89     87.0      89    441
4   105    RAJAN     89.0     98     90     98.0      90    466
5   106    RAMYA     67.0     76     67     76.0      67    353
6   107    ROHAN     56.0     67     56     67.0      56    302
7   108   ROHINI     57.0     65     57     65.0      57    301
8   109  SANDHYA     58.0     56     58     56.0      58    286
9   110  SARANYA     49.0     45     49     56.0      49    237

Updated list

In [17]:
print("\nDrop one particular column and its values:\n")
k.drop(['SOCIAL'],axis=1,inplace=True)
print(k)
print("\nUpdated list..\n")
k.to_excel("D:\dcap.xlsx")

Drop one particular column and its values:

   ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  TOTAL
0   101    DEEPA     50.0     67     50     67.0    284
1   102   DINESH     56.0     89     56     89.0    346
2   103   KAVIYA     80.0     80     80     80.0    400
3   104  RACHEAL     89.0     87     89     87.0    441
4   105    RAJAN     89.0     98     90     98.0    466
5   106    RAMYA     67.0     76     67     76.0    353
6   107    ROHAN     56.0     67     56     67.0    302
7   108   ROHINI     57.0     65     57     65.0    301
8   109  SANDHYA     58.0     56     58     56.0    286
9   110  SARANYA     49.0     45     49     56.0    237

Updated list..

In [19]:
print("\nDrop NaN rows:\n")
df=pd.read_excel("D:\dcap.xlsx")
print(df)
x=df.dropna()
print(x)
print("\nUpdated data list:\n")
x.to_excel("D:\dcap.xlsx")

Drop NaN rows:

   Unnamed: 0  ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  TOTAL
0           0   101    DEEPA       50     67     50       67    284
1           1   102   DINESH       56     89     56       89    346
2           2   103   KAVIYA       80     80     80       80    400
3           3   104  RACHEAL       89     87     89       87    441
4           4   105    RAJAN       89     98     90       98    466
5           5   106    RAMYA       67     76     67       76    353
6           6   107    ROHAN       56     67     56       67    302
7           7   108   ROHINI       57     65     57       65    301
8           8   109  SANDHYA       58     56     58       56    286
9           9   110  SARANYA       49     45     49       56    237
   Unnamed: 0  ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  TOTAL
0           0   101    DEEPA       50     67     50       67    284
1           1   102   DINESH       56     89     56       89    346
2           2   103   KAVIYA       80     80     80       80    400
3           3   104  RACHEAL       89     87     89       87    441
4           4   105    RAJAN       89     98     90       98    466
5           5   106    RAMYA       67     76     67       76    353
6           6   107    ROHAN       56     67     56       67    302
7           7   108   ROHINI       57     65     57       65    301
8           8   109  SANDHYA       58     56     58       56    286
9           9   110  SARANYA       49     45     49       56    237

Updated data list:

In [20]:
print("\nReplace values:\n")
n=pd.read_excel("D:\dcap.xlsx")
print("\nOriginal data:\n")
print(n)
y=n.replace({89:88})
print("\nReplaced dataset:\n")
print(y)
print("\nUpdated dataset:\n")
y.to_excel("D:\dcap.xlsx")

Replace values:


Original data:

   Unnamed: 0.1  Unnamed: 0  ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  \
0             0           0   101    DEEPA       50     67     50       67
1             1           1   102   DINESH       56     89     56       89
2             2           2   103   KAVIYA       80     80     80       80
3             3           3   104  RACHEAL       89     87     89       87
4             4           4   105    RAJAN       89     98     90       98
5             5           5   106    RAMYA       67     76     67       76
6             6           6   107    ROHAN       56     67     56       67
7             7           7   108   ROHINI       57     65     57       65
8             8           8   109  SANDHYA       58     56     58       56
9             9           9   110  SARANYA       49     45     49       56

   TOTAL
0    284
1    346
2    400
3    441
4    466
5    353
6    302
7    301
8    286
9    237

Replaced dataset:

   Unnamed: 0.1  Unnamed: 0  ROLL     NAME  ENGLISH  TAMIL  MATHS  SCIENCE  \
0             0           0   101    DEEPA       50     67     50       67
1             1           1   102   DINESH       56     88     56       88
2             2           2   103   KAVIYA       80     80     80       80
3             3           3   104  RACHEAL       88     87     88       87
4             4           4   105    RAJAN       88     98     90       98
5             5           5   106    RAMYA       67     76     67       76
6             6           6   107    ROHAN       56     67     56       67
7             7           7   108   ROHINI       57     65     57       65
8             8           8   109  SANDHYA       58     56     58       56
9             9           9   110  SARANYA       49     45     49       56

   TOTAL
0    284
1    346
2    400
3    441
4    466
5    353
6    302
7    301
8    286
9    237

Updated dataset:

In [21]:
df=pd.read_excel("D:\dcap.xlsx")
print(df)
print("\nExtract using isin() function:\n")
new=df['ENGLISH'].isin([88])
print(df[new])

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  ROLL     NAME  ENGLISH  TAMIL  \
0             0             0           0   101    DEEPA       50     67
1             1             1           1   102   DINESH       56     88
2             2             2           2   103   KAVIYA       80     80
3             3             3           3   104  RACHEAL       88     87
4             4             4           4   105    RAJAN       88     98
5             5             5           5   106    RAMYA       67     76
6             6             6           6   107    ROHAN       56     67
7             7             7           7   108   ROHINI       57     65
8             8             8           8   109  SANDHYA       58     56
9             9             9           9   110  SARANYA       49     45

   MATHS  SCIENCE  TOTAL
0     50       67    284
1     56       88    346
2     80       80    400
3     88       87    441
4     90       98    466
5     67       76    353
6     56       67    302
7     57       65    301
8     58       56    286
9     49       56    237

Extract using isin() function:

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  ROLL     NAME  ENGLISH  TAMIL  \
3             3             3           3   104  RACHEAL       88     87
4             4             4           4   105    RAJAN       88     98

   MATHS  SCIENCE  TOTAL
3     88       87    441
4     90       98    466